# Cumulative salary sum

* Source: https://leetcode.com/problems/find-cumulative-salary-of-an-employee/
* Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

The following table holds monthly salary information for several employees. Write a query to get, for each month, the cumulative sum of an employeeâ€™s salary over a period of 3 months, excluding the most recent month. The result should be ordered by ascending employee ID and month.

In [2]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

# Part A

For each row, rank it by the month, ordered with more recent months coming before previous months.

In [7]:
%%sql

 * postgresql://fknight:***@localhost/postgres
9 rows affected.

[(1, 1, '$20.00', 4),
 (1, 2, '$30.00', 3),
 (1, 3, '$40.00', 2),
 (1, 4, '$60.00', 1),
 (2, 1, '$20.00', 2),
 (2, 2, '$30.00', 1),
 (3, 2, '$40.00', 3),
 (3, 3, '$60.00', 2),
 (3, 4, '$70.00', 1)]

# Part B

Using the subquery from Part A, solve the original problem.

```sql
WITH month_ranks AS (
    SELECT 
        *, 
        rank() OVER (PARTITION by id ORDER BY pay_month DESC) 
            AS month_rank
    FROM employees
    ORDER BY id, pay_month
)
```

## The full solution is given below

In [5]:
%%sql

-- add column for descending month rank (latest month = 1) 
-- for each employee

WITH t1 AS (
    SELECT 
        *, 
        rank() OVER (PARTITION by id ORDER BY pay_month DESC) 
        AS month_rank
    FROM employees 
)

-- create cumulative salary sum using sum() as window function,
-- filter to exclude latest month and months 5+, order by ID and
-- month

SELECT 
    id, 
    pay_month, 
    salary, 
    sum(salary) OVER (PARTITION by id ORDER BY month_rank DESC) 
    AS cumulative_sum
FROM t1
WHERE month_rank != 1
AND month_rank <= 4 
ORDER BY id, pay_month

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, 1, '$20.00', '$20.00'),
 (1, 2, '$30.00', '$50.00'),
 (1, 3, '$40.00', '$90.00'),
 (2, 1, '$20.00', '$20.00'),
 (3, 2, '$40.00', '$40.00'),
 (3, 3, '$60.00', '$100.00')]